In [2]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series([1,4,6,5,7,10,6])
s

0     1
1     4
2     6
3     5
4     7
5    10
6     6
dtype: int64

In [6]:
s.describe()

count     7.000000
mean      5.571429
std       2.760262
min       1.000000
25%       4.500000
50%       6.000000
75%       6.500000
max      10.000000
dtype: float64

In [9]:
s.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [10]:
s2 = pd.Series([11,5,8])

In [11]:
s = s.append(s2)

In [12]:
s

0     1
1     4
2     6
3     5
4     7
5    10
6     6
0    11
1     5
2     8
dtype: int64

In [13]:
df = pd.DataFrame(
    [['schollet/keras', 11302], ['openai/universe', 4350], ['pandas-dev/pandas', 8168]]
)

In [15]:
df.shape # qual a dimenssão

(3, 2)

In [16]:
df

                   0      1
0     schollet/keras  11302
1    openai/universe   4350
2  pandas-dev/pandas   8168

In [17]:
# assinalando nome as colunas
df = pd.DataFrame(
    [['schollet/keras', 11302], ['openai/universe', 4350], ['pandas-dev/pandas', 8168]],
    columns=['repository','stars']
)

In [18]:
df

          repository  stars
0     schollet/keras  11302
1    openai/universe   4350
2  pandas-dev/pandas   8168

In [22]:
df['stars']

0    11302
1     4350
2     8168
Name: stars, dtype: int64

In [25]:
df['stars'].mean()

7940.0

In [28]:
df.iloc[1] #acessando objeto atraves de um indice

repository    openai/universe
stars                    4350
Name: 1, dtype: object

In [30]:
df = pd.DataFrame(
    [
        ['PE','Pernanbuco','Recife'],['RJ','Rio de Janeiro', 'Rio de Janeiro'],
        ['PB','Paraíba','João Pessoa'],['SP','São Paulo','São Paulo'],
        ['MG','Minas Gerais','Belo Horizonte'],['CE','Ceará','Fortaleza'],
        ['AC','Acre','Rio Branco'],['MA','Maranhão','São Luís'], ['RN','Rio Grande do Norte','Natal'],
        ['PR','Paraná','Curitiba'],['RS','Rio Grande do Sul','Porto Alegre']
    ], columns=['Sigla','Nome','Capital']
)

In [32]:
df['Sigla']

0     PE
1     RJ
2     PB
3     SP
4     MG
5     CE
6     AC
7     MA
8     RN
9     PR
10    RS
Name: Sigla, dtype: object

In [34]:
df.loc[0]

Sigla              PE
Nome       Pernanbuco
Capital        Recife
Name: 0, dtype: object

In [35]:
df.ix[:2]

c:\users\julio.pinto\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

  Sigla            Nome         Capital
0    PE      Pernanbuco          Recife
1    RJ  Rio de Janeiro  Rio de Janeiro
2    PB         Paraíba     João Pessoa

In [37]:
df.loc[:2]

  Sigla            Nome         Capital
0    PE      Pernanbuco          Recife
1    RJ  Rio de Janeiro  Rio de Janeiro
2    PB         Paraíba     João Pessoa

In [38]:
df.index = pd.Index([1,2,3,4,5,6,7,8,9,10,11])

In [39]:
df

   Sigla                 Nome         Capital
1     PE           Pernanbuco          Recife
2     RJ       Rio de Janeiro  Rio de Janeiro
3     PB              Paraíba     João Pessoa
4     SP            São Paulo       São Paulo
5     MG         Minas Gerais  Belo Horizonte
6     CE                Ceará       Fortaleza
7     AC                 Acre      Rio Branco
8     MA             Maranhão        São Luís
9     RN  Rio Grande do Norte           Natal
10    PR               Paraná        Curitiba
11    RS    Rio Grande do Sul    Porto Alegre

In [49]:
df.loc['PE']

Sigla              PE
Nome       Pernanbuco
Capital        Recife
Name: PE, dtype: object

In [50]:
del df['Sigla']

In [51]:
df

                      Nome         Capital
Sigla
PE              Pernanbuco          Recife
RJ          Rio de Janeiro  Rio de Janeiro
PB                 Paraíba     João Pessoa
SP               São Paulo       São Paulo
MG            Minas Gerais  Belo Horizonte
CE                   Ceará       Fortaleza
AC                    Acre      Rio Branco
MA                Maranhão        São Luís
RN     Rio Grande do Norte           Natal
PR                  Paraná        Curitiba
RS       Rio Grande do Sul    Porto Alegre